<a href="https://colab.research.google.com/github/dudaspm/IST210-Spring2020/blob/master/SQL/StartingSQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Start learning SQL in Google Colab

### Introduction

In this example, we will start using SQL in Google Colab Notebook.

But first, let's just remind ourselves some of the basics of Google Colab.

Let's start with just running a bit of "code." The cell I am currently is a "Text" cell (using +Text). For code, we want to use a "code" cell (+Code). The below statement will just add two numbers together, nothing too fancy.

In [0]:
2 + 2

4

Your turn! 


1.   Click on the "+Code" button in the top-left corner. 
2.   Figure out the answer for the following math problem.
\begin{equation*}
(102939129381 / 231)  + 12300
\end{equation*}

Pretty easy so far, huh?

OK, next to the SQL.

### SQL Start

One of the cool trick you can do in Jupyter Notebooks is something so amazing, you might even think its magic! Well, it technically is. 

Jupyter has a number of built in utilities, which they call [magic](https://ipython.readthedocs.io/en/stable/interactive/magics.html). Don't worry about trying to learn them all, we only need one specific type of magic. SQL magic. Actually, we technically need %load_ext magic, but this will load SQL for us.

In [0]:
%load_ext sql

This is a built-in Python SQL toolkit provide by (another magic reference) [SQL Alchemy](https://www.sqlalchemy.org/). Again, you don't need to worry too much about SQL Alchemy, only that we can now use SQL code in our notebook.

The next step is create a database, so in this case we use the following command. Note: we will be expanding on this through-out the semester, but for now... it creates a single, SQLite database for this notebook. Also, if the command runs *successfully*, you should see " 'Connected: @None' "

In [0]:
%sql sqlite://

'Connected: @None'

Now it is time to create our first table. This is where the SQL commands become available to us. The first command is...

#### Create

Create will create a table. In this case, we will call the table *Student* and we will need to tell the table the names of the attributes and what *type* of attribute they are as well. For now, we will be using only using 3 types:


*   INTEGER - whole numbers (example: 3)
*   REAL - floats or real numbers (example: 3.14) 
*   TEXT - text information (example: "hello world!")

For us, we need 3 attributes and all 3 will be text.

In [0]:
%%sql   
CREATE TABLE Student(PSUID text, firstname text, lastname text);

 * sqlite://
Done.

[]

Now let's add some data to this table. In this case we use...

#### INSERT

Insert does as it sounds. Insert data into the database. 
The syntax for this is:

INSERT INTO *name of the table* VALUES (*data for PSUID*,*lastname*, *firstname*) 

For now, I will just make up a few tuples.

In [0]:
%%sql 
INSERT INTO Student VALUES('9139128181','David','Practice');
INSERT INTO Student VALUES('9771271281','Susan','Practice');
INSERT INTO Student VALUES('9383818823','Lee','Example');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

OK, we have a Database. A table in this database. 3 tuples in our table. The last thing we need is a way to access this data, view the data, and do something with the data. That's where we use...

#### SELECT

SELECT allows us to select all or part of the data. For now, all we want to do is get back from the table all the data in the table. For this we will use:

SELECT  *(wildcard!)* FROM *table name*

The wildcard basically means *All the Attributes* in the table

In [0]:
%%sql 
SELECT * FROM Student

 * sqlite://
Done.

[('9139128181', 'David', 'Practice'),
 ('9771271281', 'Susan', 'Practice'),
 ('9383818823', 'Lee', 'Example')]

That is it for now!